plazaap/app/controllers/luces_controller.rb

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def status
    @luces=Luce.first

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "luces" SET "perim" = ?, "updated_at" = ? WHERE "luces"."id" = ?  [["perim", 0], ["updated_at", "2018-10-23 22:27:06.584188"], ["id", 1]]
---
  def perch
    @luces=Luce.first
    @luces.perim=params[:value]
    @luces.save

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "luces" SET "inter" = ?, "updated_at" = ? WHERE "luces"."id" = ?  [["inter", 0], ["updated_at", "2018-10-23 23:48:53.893023"], ["id", 1]]
---
  def intch
    @luces=Luce.first
    @luces.inter=params[:value]
    @luces.save

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "luces" SET "park" = ?, "updated_at" = ? WHERE "luces"."id" = ?  [["park", 0], ["updated_at", "2018-10-23 23:47:31.418101"], ["id", 1]]
---
  def parkch
    @luces=Luce.first
    @luces.park=params[:value]
    @luces.save

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "luces" SET "par_r" = ?, "par_g" = ?, "par_b" = ?, "updated_at" = ? WHERE "luces"."id" = ?  [["par_r", 7], ["par_g", 7], ["par_b", 92], ["updated_at", "2018-10-24 02:07:46.076026"], ["id", 1]]
---
  def colorch
    @luces=Luce.first
    @luces.par_r=params[:r]
    @luces.par_g=params[:g]
    @luces.par_b=params[:b]
    @luces.save

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "luces" SET "perim" = ?, "inter" = ?, "park" = ?, "par_r" = ?, "par_g" = ?, "par_b" = ?, "updated_at" = ? WHERE "luces"."id" = ?  [["perim", 1], ["inter", 1], ["park", 1], ["par_r", 80], ["par_g", 240], ["par_b", 215], ["updated_at", "2018-10-24 02:26:54.910836"], ["id", 1]]
---
  def turn_on_all
    @luces=Luce.first
    @luces.perim=1
    @luces.inter=1
    @luces.park=1
    @luces.par_r= 80
    @luces.par_g=240
    @luces.par_b=215
    @luces.save

SELECT  "luces".* FROM "luces" ORDER BY "luces"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "luces" SET "perim" = ?, "inter" = ?, "park" = ?, "par_r" = ?, "par_g" = ?, "par_b" = ?, "updated_at" = ? WHERE "luces"."id" = ?  [["perim", 0], ["inter", 0], ["park", 0], ["par_r", 0], ["par_g", 0], ["par_b", 0], ["updated_at", "2018-10-24 02:26:40.919921"], ["id", 1]]
---
  def turn_off_all
    @luces=Luce.first
    @luces.perim=0
    @luces.inter=0
    @luces.park=0
    @luces.par_r=0
    @luces.par_g=0
    @luces.par_b=0
    @luces.save